In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
	"name": ['Lini','Tom', 'Jerry', 'John', 'Rohan'],
	"marks": [94, 87, 96, 83, 70],
	"city": ['rampur', 'jampur', 'nagpur', 'kolkata', 'bhimnagar']}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

    name  marks       city
0   Lini     94     rampur
1    Tom     87     jampur
2  Jerry     96     nagpur
3   John     83    kolkata
4  Rohan     70  bhimnagar

In [5]:
df.to_csv('demo.csv')

In [6]:
df.to_csv('demo.csv', index = False)

In [7]:
df.head(2)

   name  marks    city
0  Lini     94  rampur
1   Tom     87  jampur

In [8]:
df.tail(2)

    name  marks       city
3   John     83    kolkata
4  Rohan     70  bhimnagar

In [9]:
df.describe()

           marks
count   5.000000
mean   86.000000
std    10.368221
min    70.000000
25%    83.000000
50%    87.000000
75%    94.000000
max    96.000000

In [10]:
df2 = pd.read_csv('demo2.csv')

In [11]:
df2

   Car no.  Speed Name
0     5457     32  Tom
1     6776     56  Jay
2     1324     88  Ram

In [12]:
s1 = pd.Series(np.random.rand(100))

In [13]:
type(s1)

pandas.core.series.Series

In [14]:
s1

0     0.097847
1     0.417978
2     0.332543
3     0.944300
4     0.395321
        ...
95    0.255568
96    0.667278
97    0.326054
98    0.181209
99    0.978722
Length: 100, dtype: float64

In [15]:
df3 = pd.DataFrame(np.random.rand(300,3))

In [16]:
type(df3)

pandas.core.frame.DataFrame

In [17]:
df3

            0         1         2
0    0.620941  0.080718  0.732298
1    0.727507  0.364668  0.636062
2    0.100135  0.941301  0.900951
3    0.085729  0.540790  0.185462
4    0.651850  0.431992  0.931325
..        ...       ...       ...
295  0.264720  0.142713  0.331470
296  0.835937  0.809118  0.902854
297  0.433851  0.244457  0.860227
298  0.411502  0.964472  0.630219
299  0.170759  0.055356  0.767717

[300 rows x 3 columns]

In [18]:
df3.iloc[0,1]

0.08071752923472209

In [19]:
df3.loc[0,1] = 0.4

In [20]:
df3

            0         1         2
0    0.620941  0.400000  0.732298
1    0.727507  0.364668  0.636062
2    0.100135  0.941301  0.900951
3    0.085729  0.540790  0.185462
4    0.651850  0.431992  0.931325
..        ...       ...       ...
295  0.264720  0.142713  0.331470
296  0.835937  0.809118  0.902854
297  0.433851  0.244457  0.860227
298  0.411502  0.964472  0.630219
299  0.170759  0.055356  0.767717

[300 rows x 3 columns]

In [21]:
df3[1].count()

300

In [22]:
df3[1].sum()

147.88448125869212

In [23]:
df3[1].mean()

0.4929482708623071

In [24]:
df3[1].median()

0.49198369379985435

In [25]:
df3[1].min()

0.014748963459782605

In [26]:
df3[1].max()

0.9904574378887279

In [27]:
df3.describe()

                0           1           2
count  300.000000  300.000000  300.000000
mean     0.518225    0.492948    0.538172
std      0.297306    0.281815    0.287278
min      0.002477    0.014749    0.006666
25%      0.263747    0.253581    0.303077
50%      0.515216    0.491984    0.586595
75%      0.792204    0.732681    0.771158
max      0.997510    0.990457    0.998851